❄️🍦 Welcome to the Magical IceCream Land 🍦❄️
✨ 오늘도 달콤한 하루가 시작됩니다! ✨
🛎️ 손님~ 어떤 아이스크림을 원하시나요?
--------------------------------------------------

🍧 IceCream Menu 🍧
1️ 아이스크림 추가
2️ 아이스크림 목록 보기
3️ 아이스크림 제거
4️ 아이스크림 존재 확인
5️ 총 아이스크림 개수
6️ 총 아이스크림 정렬
0️ 종료
👉 선택: 1
아이스크림 이름 : aaa
아이스크림 가격 : 1500
✅aaa추가 완료!

🍧 IceCream Menu 🍧
1️ 아이스크림 추가
2️ 아이스크림 목록 보기
3️ 아이스크림 제거
4️ 아이스크림 존재 확인
5️ 총 아이스크림 개수
6️ 총 아이스크림 정렬
0️ 종료
👉 선택: 1
아이스크림 이름 : bbb
아이스크림 가격 : 1800
✅bbb추가 완료!

🍧 IceCream Menu 🍧
1️ 아이스크림 추가
2️ 아이스크림 목록 보기
3️ 아이스크림 제거
4️ 아이스크림 존재 확인
5️ 총 아이스크림 개수
6️ 총 아이스크림 정렬
0️ 종료
👉 선택: 1
아이스크림 이름 : ccc
아이스크림 가격 : 1600
✅ccc추가 완료!

🍧 IceCream Menu 🍧
1️ 아이스크림 추가
2️ 아이스크림 목록 보기
3️ 아이스크림 제거
4️ 아이스크림 존재 확인
5️ 총 아이스크림 개수
6️ 총 아이스크림 정렬
0️ 종료
👉 선택: 6
정렬 기준 선택: 1) 이름순  2) 가격순
1
🍦 이름순으로 정렬 완료!

🍧 IceCream Menu 🍧
1️ 아이스크림 추가
2️ 아이스크림 목록 보기
3️ 아이스크림 제거
4️ 아이스크림 존재 확인
5️ 총 아이스크림 개수
6️ 총 아이스크림 정렬
0️ 종료
👉 선택: 2
- aaa (1500원)
- bbb (1800원)
- ccc (1600원)

🍧 IceCream Menu 🍧
1️ 아이스크림 추가
2️ 아이스크림 목록 보기
3️ 아이스크림 제거
4️ 아이스크림 존재 확인
5️ 총 아이스크림 개수
6️ 총 아이스크림 정렬
0️ 종료
👉 선택: 6
정렬 기준 선택: 1) 이름순  2) 가격순
2
🍦 가격순으로 정렬 완료!

🍧 IceCream Menu 🍧
1️ 아이스크림 추가
2️ 아이스크림 목록 보기
3️ 아이스크림 제거
4️ 아이스크림 존재 확인
5️ 총 아이스크림 개수
6️ 총 아이스크림 정렬
0️ 종료
👉 선택: 2
- aaa (1500원)
- ccc (1600원)
- bbb (1800원)

🍧 IceCream Menu 🍧
1️ 아이스크림 추가
2️ 아이스크림 목록 보기
3️ 아이스크림 제거
4️ 아이스크림 존재 확인
5️ 총 아이스크림 개수
6️ 총 아이스크림 정렬
0️ 종료
👉 선택: 